; domain
(define (domain furniture-assembly)
	(:requirements :strips :typing)
	(:types
		tool tool-part - object
		table-top table-leg chair-base chair-leg chair-seat shelf-frame shelf-box desk-plane desk-drawer - tool
		handle-part action-part - tool-part
		gripper
	)

	(:predicates
		(on ?t1 - tool ?t2 - tool)
		(on-floor ?t - tool)
		(clear ?t - tool)
		(empty ?g - gripper)
		(in-hand ?g - gripper ?t - tool)
		(screwed-into ?t - tool ?s - tool)
        (connected-to ?t - tool ?s - tool)
		(part-of ?tp - tool-part ?t - tool)
		(affords-picking ?tp - handle-part)
		(affords-screwing ?tp - action-part)
        (affords-connecting ?tp - action-part)
		(affords-hammering ?tp - action-part)
		(affords-turning-on ?tp - action-part)
		(affords-turning-off ?tp - action-part)
		(affords-placing ?t - tool)
		(affords-screwing-into ?s - tool ?tp - tool-part ?t - tool)
        (affords-connecting-to ?s - tool ?tp - tool-part ?t - tool)
	)

	(:action pick-up-from-tool
		:parameters (?g - gripper ?tp - handle-part ?t - tool ?s - tool)
		:precondition (and (clear ?t) (empty ?g) (on ?t ?s) (part-of ?tp ?t) (affords-picking ?tp))
		:effect (and (in-hand ?g ?t) (clear ?s) (not (clear ?t)) (not (empty ?g)) (not (on ?t ?s)))
	)

	(:action pick-up-from-floor
		:parameters (?g - gripper ?tp - handle-part ?t - tool)
		:precondition (and (clear ?t) (empty ?g) (on-floor ?t) (part-of ?tp ?t) (affords-picking ?tp))
		:effect (and (in-hand ?g ?t) (not (clear ?t)) (not (empty ?g)) (not (on-floor ?t)))
	)

	(:action put-on-floor
		:parameters (?g - gripper ?t - tool)
		:precondition (and (in-hand ?g ?t) (affords-placing ?t))
		:effect (and (on-floor ?t) (clear ?t) (empty ?g) (not (in-hand ?g ?t)))
	)

	(:action screw-into
		:parameters (?g - gripper ?tp - action-part ?tl - tool ?th - tool-part ?tt - tool)
		:precondition (and (in-hand ?g ?tl) (part-of ?tp ?tl) (affords-screwing ?tp) (part-of ?th ?tt) (affords-screwing-into ?tl ?th ?tt))
		:effect (and (screwed-into ?tl ?tt) (clear ?tl) (empty ?g) (not (in-hand ?g ?tl)))
	)

    (:action connect-to
		:parameters (?g - gripper ?tp - action-part ?tl - tool ?th - tool-part ?tt - tool)
		:precondition (and (in-hand ?g ?tl) (part-of ?tp ?tl) (affords-connecting ?tp) (part-of ?th ?tt) (affords-connecting-to ?tl ?th ?tt))
		:effect (and (connected-to ?tl ?tt) (clear ?tl) (empty ?g) (not (in-hand ?g ?tl)))
	)
)

; problem
(define (problem table-assembly-full)
	(:domain furniture-assembly)
	(:objects
		seat - chair-seat
		left-leg right-leg - chair-leg
		left-leg-base right-leg-base seat-base - handle-part
		left-leg-connect right-leg-connect - action-part
		seat-connector-left seat-connector-right - tool-part
		robot-gripper - gripper
	)

	(:init
		(on-floor seat)
		(on-floor left-leg)
		(on-floor right-leg)

		(clear seat)
		(clear left-leg)
		(clear right-leg)

		(empty robot-gripper)

		(part-of seat-base seat)
		(part-of left-leg-base left-leg)
		(part-of right-leg-base right-leg)

		(part-of left-leg-connect left-leg)
        (part-of right-leg-connect right-leg)
        (part-of seat-connector-left seat)
        (part-of seat-connector-right seat)

		(affords-picking seat-base)
		(affords-picking left-leg-base)
		(affords-picking right-leg-base)

		(affords-connecting left-leg-connect)
        (affords-connecting right-leg-connect)
		(affords-connecting-to left-leg seat-connector-left seat)
        (affords-connecting-to right-leg seat-connector-right seat)
	)

	(:goal (and (connected-to left-leg seat)
				(connected-to right-leg seat)
		   	)
	)
)

; plan
1. (pick-up-from-floor robot-gripper right-leg-base right-leg)
   deleted: (clear right-leg) (empty robot-gripper) (on-floor right-leg)
   added: (in-hand robot-gripper right-leg)
   goals met: 0 of 2
2. (connect-to robot-gripper right-leg-connect right-leg seat-connector-right seat)
   deleted: (in-hand robot-gripper right-leg)
   added: (connected-to right-leg seat) (clear right-leg) (empty robot-gripper)
   goals met: 1 of 2
3. (pick-up-from-floor robot-gripper left-leg-base left-leg)
   deleted: (clear left-leg) (empty robot-gripper) (on-floor left-leg)
   added: (in-hand robot-gripper left-leg)
   goals met: 1 of 2
4. (connect-to robot-gripper left-leg-connect left-leg seat-connector-left seat)
   deleted: (in-hand robot-gripper left-leg)
   added: (connected-to left-leg seat) (clear left-leg) (empty robot-gripper)
   goals met: 2 of 2
